markohladjak/Diamond/NodesController/src/Net/ESP32MeshNetService.cpp
/*
 * ESP32MeshNetService.cpp
 *
 *  Created on: Mar 19, 2021
 *      Author: rem
 */


#include <string.h>
#include "esp_wifi.h"
#include "esp_system.h"
#include "esp_event.h"
#include "esp_event_loop.h"
#include "esp_log.h"
#include "esp_mesh_internal.h"
#include "mdns.h"
#include "nvs_flash.h"
#include <Net/ESP32MeshNetService.h>
#include <LogService.h>
#include <Net/NetMessage.h>
#include <Net/NetAddress.h>

#include <ESP32Ping.h>


#include <WString.h>


namespace diamon {

#undef ESP_LOGI
#undef ESP_LOGW
#define ESP_LOGI(tag, ...) Serial.printf(__VA_ARGS__)
#define ESP_LOGW(tag, ...) Serial.printf(__VA_ARGS__)


QueueHandle_t ESP32MeshNetService::_send_mutex = xSemaphoreCreateMutex();


//String ESP32MeshNetService::_router_ssid = "TP-LINK_18";
//String ESP32MeshNetService::_router_pw = "13643522";
//String ESP32MeshNetService::_router_ssid = "Tenda_0AD898";
//String ESP32MeshNetService::_router_pw = "12345678";
//String ESP32MeshNetService::_router_ssid = "TP-Link_982C";
//String ESP32MeshNetService::_router_pw = "33188805";
//String ESP32MeshNetService::_router_ssid = "HUAWEI MediaPad T5";
//String ESP32MeshNetService::_router_pw = "123321123";
String ESP32MeshNetService::_router_ssid = "DiamandNC";
String ESP32MeshNetService::_router_pw = "nodesAdmin";
//String ESP32MeshNetService::_router_ssid = "Toyota_WiFi";
//String ESP32MeshNetService::_router_pw = "Toyota2021";
//String ESP32MeshNetService::_router_ssid = "TD3";
//String ESP32MeshNetService::_router_pw = "ServiceStation1!";

int	ESP32MeshNetService::_router_chennel = 1;

String ESP32MeshNetService::_mesh_pw = "34578456";

bool ESP32MeshNetService::_is_mesh_connected = false;
bool ESP32MeshNetService::_is_mesh_initialized = false;

int ESP32MeshNetService::_max_device_count = 100;
int ESP32MeshNetService::_max_connection = 10;  // 10 MAX

int ESP32MeshNetService::_mesh_layer = -1;
mesh_addr_t ESP32MeshNetService::_mesh_parent_addr;
uint64_t ESP32MeshNetService::_node_addr_mask = 0;

const uint8_t ESP32MeshNetService::MESH_ID[6] = { 0x81, 0x81, 0x81, 0x81, 0x81, 0x81 };

_layer_changed_callback_funct_t ESP32MeshNetService::_layer_changed_callback_funct = NULL;
_is_root_callback_funct_t ESP32MeshNetService::_is_root_callback_funct = NULL;

bool ESP32MeshNetService::_is_running = false;

bool ESP32MeshNetService::_is_root = false;
bool ESP32MeshNetService::_is_root_fixed = true;

std::map<NetAddress, ESP32MeshNetService*> ESP32MeshNetService::_local;

#define RX_SIZE          (1500)
#define TX_SIZE          (1460)

static uint8_t tx_buf[TX_SIZE] = { 0, };
static uint8_t rx_buf[RX_SIZE] = { 0, };

bool is_rx_running = false;

//WIFI_REASON_CIPHER_SUITE_REJECTED

ESP32MeshNetService::ESP32MeshNetService(uint16_t device_num) {
	Address = self_address(device_num);

	_local[Address] = this;
}

ESP32MeshNetService::~ESP32MeshNetService() {
	_local.erase(Address);

	if (!_local.size() && _is_mesh_initialized)
		deinit();
}

void ESP32MeshNetService::Init() {
	if (!_is_mesh_initialized)
		init();
}

void ESP32MeshNetService::Start() {
	if (!_is_mesh_initialized) {
	    ESP_LOGI(MESH_TAG, "mesh not initialized\n");

	    return;
	}

	ESP_ERROR_CHECK(esp_mesh_start());
    ESP_LOGI(MESH_TAG, "mesh starts successfully, heap:%d, %s\n",  esp_get_free_heap_size(),
             esp_mesh_is_root_fixed() ? "root fixed" : "root not fixed");

    print_route_table();
}

void ESP32MeshNetService::send_msg(NetMessage &msg, NetAddress to) {
	xSemaphoreTake(_send_mutex, portMAX_DELAY);

	LogService::Log("ESP32MeshNetService::Send", msg);

	esp_err_t err;
    mesh_addr_t route_table[_max_device_count];
    int route_table_size = 0;
    mesh_data_t data;
    data.data = tx_buf;
    data.size = sizeof(tx_buf);
    data.proto = MESH_PROTO_JSON;
    data.tos = MESH_TOS_P2P;
    bool to_server = false;

//    if (to == NetAddress::BROADCAST)
//    	esp_mesh_get_routing_table((mesh_addr_t *) &route_table, _max_device_count * 6, &route_table_size);
//    else
    if (to == NetAddress::SERVER) {
    	route_table_size = 1;

    	to_server = true;
    }
    else {
    	uint64_t addr = (uint64_t)to;
    	uint8_t *mac = ((uint8_t*)&addr) + 2;

    	memcpy(route_table[0].addr, mac, 6);

    	route_table_size = 1;
    }

    String json = msg;

	memcpy(tx_buf, json.c_str(), json.length());
	data.size = json.length();

	for (int i = 0; i < route_table_size; ++i) {
		printf(">%3d    " MACSTR "\n", i, MAC2STR(route_table[i].addr));

		err = esp_mesh_send(to_server ? NULL : &route_table[i], &data, MESH_DATA_P2P, NULL, 0);
		if (err) {
			ESP_LOGE(MESH_TAG,
					 "[ROOT-2-UNICAST:%d][L:%d]parent:" MACSTR " to " MACSTR ", heap:%d[err:0x%x, proto:%d, tos:%d]",
					 send_count, mesh_layer, MAC2STR(mesh_parent_addr.addr),
					 MAC2STR(route_table[i].addr), esp_get_minimum_free_heap_size(),
					 err, data.proto, data.tos);
		}
	}

	xSemaphoreGive(_send_mutex);
}

void ESP32MeshNetService::Send(NetMessage &msg, NetAddress to) {
    SetMessageEnds(msg, &Address, &to);

    send_msg(msg, to);
}

void ESP32MeshNetService::Send(CommunicationData* data, NetAddress to) {
	NetMessage msg(data);

	Send(msg, to);
}

void ESP32MeshNetService::OnReceive(NetAddress from, void (*onReceive)(NetMessage&)) {


    }

void ESP32MeshNetService::setWIFIMode(String ssid, String pw) {
//	mesh_router_t router;
//
//	memset(&router, 0, sizeof(router));
//
//	memcpy(router.ssid, ssid.c_str(), ssid.length());
//	memcpy(router.password, pw.c_str(), pw.length());
//	router.ssid_len = ssid.length();
//	router.allow_router_switch = true;

	wifi_config_t parent_cfg;

    memset(&parent_cfg, 0, sizeof(wifi_config_t));

    parent_cfg.sta.bssid_set = false;
    parent_cfg.sta.channel = _router_chennel;

    memcpy((uint8_t *) &parent_cfg.sta.ssid, ssid.c_str(), ssid.length());
    memcpy((uint8_t *) &parent_cfg.sta.password, pw.c_str(), pw.length());

//	LogService::Log("Set new router", (const char *)router.ssid);
//	LogService::Log("     pw", (const char *)router.password);

//	ESP_ERROR_CHECK(esp_mesh_set_self_organized(0, 0));

//	esp_mesh_disconnect();

