markohladjak/Diamond/NodesController/src/Net/ESP32MeshNetService.cpp
	esp_mesh_set_parent(&parent_cfg, NULL, mesh_type_t::MESH_ROOT, MESH_ROOT_LAYER);

//	esp_mesh_set_router(&router);

//	ESP_ERROR_CHECK(esp_mesh_set_self_organized(1, 0));
}

std::list<NetAddress> ESP32MeshNetService::GetConnectedDevices() {
	return std::list<NetAddress>();
}

void ESP32MeshNetService::GetAPList() {
	wifi_scan();
}

void ESP32MeshNetService::OnLayerChangedCallbackRegister(_layer_changed_callback_funct_t funct) {
	_layer_changed_callback_funct = funct;
}

void ESP32MeshNetService::OnIsRootCallbackRegister(_is_root_callback_funct_t funct){
	_is_root_callback_funct = funct;
}

esp_err_t ESP32MeshNetService::system_event_handler(void *ctx, system_event_t *event)
{
    switch(event->event_id) {
    	case SYSTEM_EVENT_STA_GOT_IP:
			printf("Event: SYSTEM_EVENT_STA_GOT_IP\n");

	        if (esp_mesh_is_root())
				run_mdns();

			break;

		case SYSTEM_EVENT_SCAN_DONE:
//		{
//			wifi_ap_record_t *ap_info = NULL;
//			uint16_t ap_count = 0;
//
//			ESP_ERROR_CHECK(esp_wifi_scan_get_ap_num(&ap_count));
//
//			LogService::Log("wifi_scan", "1");
//
//			ap_info = new wifi_ap_record_t[ap_count];
//			memset(ap_info, 0, sizeof(wifi_ap_record_t) * ap_count);
//			LogService::Log("wifi_scan", "2");
//
//			ESP_ERROR_CHECK(esp_wifi_scan_get_ap_records(&ap_count, ap_info));
//
//			LogService::Log("wifi_scan", "3");
//
//			for (int i = 0; i < ap_count; i++) {
//				ESP_LOGI(TAG, "SSID \t\t%s     ", ap_info[i].ssid);
//				ESP_LOGI(TAG, "RSSI \t\t%d     ", ap_info[i].rssi);
//		//        print_auth_mode(ap_info[i].authmode);
//		//        if (ap_info[i]->authmode != WIFI_AUTH_WEP) {
//		//            print_cipher_type(ap_info[i].pairwise_cipher, ap_info[i].group_cipher);
//		//        }
//				ESP_LOGI(TAG, "Channel \t\t%d\n", ap_info[i].primary);
//			}
//
//			delete [] ap_info;
//
//			esp_mesh_set_self_organized(1, 0);
//			esp_mesh_connect();
//
//		}
    	break;
    default:
        break;
    }

    return ESP_OK;
}

void ESP32MeshNetService::init() {
	//    esp_log_level_set("*", esp_log_level_t::ESP_LOG_VERBOSE);

	//    ESP_ERROR_CHECK(mesh_light_init());
	    ESP_ERROR_CHECK(nvs_flash_init());
	    /*  tcpip initialization */
	    tcpip_adapter_init();
	    /* for mesh
	     * stop DHCP server on softAP interface by default
	     * stop DHCP client on station interface by default
	     * */
	    ESP_ERROR_CHECK(tcpip_adapter_dhcps_stop(TCPIP_ADAPTER_IF_AP));
	    ESP_ERROR_CHECK(tcpip_adapter_dhcpc_stop(TCPIP_ADAPTER_IF_STA));

	    if (_is_root && 0/*if static IP*/) {
			/* static ip settings */
			tcpip_adapter_ip_info_t sta_ip;
			sta_ip.ip.addr = ipaddr_addr("10.10.10.10");
			sta_ip.gw.addr = ipaddr_addr("10.10.10.1");
			sta_ip.netmask.addr = ipaddr_addr("255.255.255.0");
			tcpip_adapter_set_ip_info(tcpip_adapter_if_t::TCPIP_ADAPTER_IF_STA, &sta_ip);
	    }

//	    	esp_wifi_scan_get_ap_num
//	    	esp_timer_get_time
//	    	esp_mesh_get_tsf_time

	    /*  wifi initialization */
	    ESP_ERROR_CHECK(esp_event_loop_init(system_event_handler, NULL));
	    wifi_init_config_t config = WIFI_INIT_CONFIG_DEFAULT();
	    ESP_ERROR_CHECK(esp_wifi_init(&config));
	    ESP_ERROR_CHECK(esp_wifi_set_storage(WIFI_STORAGE_RAM));
	    ESP_ERROR_CHECK(esp_wifi_start());
	    /*  mesh initialization */
	    ESP_ERROR_CHECK(esp_mesh_init());
//	    ESP_ERROR_CHECK(esp_mesh_set_max_layer(4));
	    ESP_ERROR_CHECK(esp_mesh_set_vote_percentage(1));
	    ESP_ERROR_CHECK(esp_mesh_set_ap_assoc_expire(10));


	    if (_is_root_fixed)
	    	ESP_ERROR_CHECK(esp_mesh_fix_root(1));

	    mesh_cfg_t cfg;

	    memset(&cfg, 0, sizeof(mesh_cfg_t));

	    cfg.crypto_funcs = &g_wifi_default_mesh_crypto_funcs;
	    cfg.allow_channel_switch = true;

	    memcpy((uint8_t *) &cfg.mesh_id, MESH_ID, 6);
	    cfg.event_cb = &mesh_event_handler;
	    cfg.channel = _router_chennel;

	    cfg.router.ssid_len = _router_ssid.length();
	    memcpy((uint8_t *) &cfg.router.ssid, _router_ssid.c_str(), cfg.router.ssid_len);
	    memcpy((uint8_t *) &cfg.router.password, _router_pw.c_str(), _router_pw.length());


	    LogService::Log("ssid", (const char*)cfg.router.ssid);
	    LogService::Log("pass", (const char*)cfg.router.password);

	    /* mesh softAP */
	    ESP_ERROR_CHECK(esp_mesh_set_ap_authmode(wifi_auth_mode_t::WIFI_AUTH_WPA_WPA2_PSK));
	    cfg.mesh_ap.max_connection = _max_connection;
	    memcpy((uint8_t *) &cfg.mesh_ap.password, _mesh_pw.c_str(), _mesh_pw.length());

	    ESP_ERROR_CHECK(esp_mesh_set_config(&cfg));

	    if (_is_root) {
	    	wifi_config_t parent_cfg;

		    memset(&parent_cfg, 0, sizeof(wifi_config_t));

		    parent_cfg.sta.bssid_set = false;
		    parent_cfg.sta.channel = _router_chennel;
//		    parent_cfg.sta.bssid = { 0xc8, 0x3a, 0x35, 0x0a, 0xd8, 0x98 };
//		    *((uint32_t*)parent_cfg.sta.bssid) = 0x0a353ac8;
//		    *((uint16_t*)(parent_cfg.sta.bssid + 4)) = 0x98d8;

		    memcpy((uint8_t *) &parent_cfg.sta.ssid, _router_ssid.c_str(), _router_ssid.length());
		    memcpy((uint8_t *) &parent_cfg.sta.password, _router_pw.c_str(), _router_pw.length());

//			ESP_ERROR_CHECK(esp_mesh_set_ap_authmode(wifi_auth_mode_t::WIFI_AUTH_WPA_WPA2_PSK));

	    	esp_mesh_set_parent(&parent_cfg, NULL, mesh_type_t::MESH_ROOT, MESH_ROOT_LAYER);
	    }

	    _is_mesh_initialized = true;
}

void ESP32MeshNetService::deinit() {
///// ToDO
}

void ESP32MeshNetService::mesh_event_handler(mesh_event_t event)
{
    mesh_addr_t id = {0,};
    static uint8_t last_layer = 0;
    ESP_LOGD(MESH_TAG, "esp_event_handler:%d\n", event.id);

    switch (event.id) {
    case MESH_EVENT_STARTED:
        esp_mesh_get_id(&id);
        ESP_LOGI(MESH_TAG, "<MESH_EVENT_STARTED>ID:" MACSTR "\n", MAC2STR(id.addr));
        _is_mesh_connected = false;
        _mesh_layer = esp_mesh_get_layer();
        break;
    case MESH_EVENT_STOPPED:
        ESP_LOGI(MESH_TAG, "<MESH_EVENT_STOPPED>");
        _is_mesh_connected = false;
        _mesh_layer = esp_mesh_get_layer();
        break;
    case MESH_EVENT_CHILD_CONNECTED:
        ESP_LOGI(MESH_TAG, "<MESH_EVENT_CHILD_CONNECTED>aid:%d, " MACSTR "\n",
                 event.info.child_connected.aid,
                 MAC2STR(event.info.child_connected.mac));
        break;
    case MESH_EVENT_CHILD_DISCONNECTED:
        ESP_LOGI(MESH_TAG, "<MESH_EVENT_CHILD_DISCONNECTED>aid:%d, " MACSTR "\n",
                 event.info.child_disconnected.aid,
                 MAC2STR(event.info.child_disconnected.mac));
        break;
    case MESH_EVENT_ROUTING_TABLE_ADD:
        ESP_LOGW(MESH_TAG, "<MESH_EVENT_ROUTING_TABLE_ADD>add %d, new:%d\n",
                 event.info.routing_table.rt_size_change,
                 event.info.routing_table.rt_size_new);

        on_routing_table_changed();
        break;
    case MESH_EVENT_ROUTING_TABLE_REMOVE:
        ESP_LOGW(MESH_TAG, "<MESH_EVENT_ROUTING_TABLE_REMOVE>remove %d, new:%d\n",
                 event.info.routing_table.rt_size_change,
                 event.info.routing_table.rt_size_new);

        on_routing_table_changed();
        break;
    case MESH_EVENT_NO_PARENT_FOUND:
        ESP_LOGI(MESH_TAG, "<MESH_EVENT_NO_PARENT_FOUND>scan times:%d\n",
                 event.info.no_parent.scan_times);
        /* TODO handler for the failure */
        break;
    case MESH_EVENT_PARENT_CONNECTED:
        esp_mesh_get_id(&id);
        _mesh_layer = event.info.connected.self_layer;
        memcpy(&_mesh_parent_addr.addr, event.info.connected.connected.bssid, 6);
        ESP_LOGI(MESH_TAG,
                 "<MESH_EVENT_PARENT_CONNECTED>layer:%d-->%d, parent:" MACSTR "%s, ID:" MACSTR "\n",
                 last_layer, _mesh_layer, MAC2STR(_mesh_parent_addr.addr),
                 esp_mesh_is_root() ? "<ROOT>" :
                 (_mesh_layer == 2) ? "<layer2>" : "", MAC2STR(id.addr));
        last_layer = _mesh_layer;
        _is_mesh_connected = true;

        on_layer_changed(_mesh_layer);

        mesh_data_rxtx_start();

		if (esp_mesh_is_root()) {
			tcpip_adapter_dhcpc_start(TCPIP_ADAPTER_IF_STA);
		}
//        esp_mesh_comm_p2p_start();
        break;
    case MESH_EVENT_PARENT_DISCONNECTED:
        ESP_LOGI(MESH_TAG,
                 "<MESH_EVENT_PARENT_DISCONNECTED>reason:%d\n",
                 event.info.disconnected.reason);
        _is_mesh_connected = false;
        on_layer_changed(-1);
        _mesh_layer = esp_mesh_get_layer();
        break;
    case MESH_EVENT_LAYER_CHANGE:
        _mesh_layer = event.info.layer_change.new_layer;
        ESP_LOGI(MESH_TAG, "<MESH_EVENT_LAYER_CHANGE>layer:%d-->%d%s\n",
                 last_layer, _mesh_layer,
                 esp_mesh_is_root() ? "<ROOT>" :
                 (_mesh_layer == 2) ? "<layer2>" : "");
        last_layer = _mesh_layer;
        on_layer_changed(_mesh_layer);
        break;
    case MESH_EVENT_ROOT_ADDRESS:
        ESP_LOGI(MESH_TAG, "<MESH_EVENT_ROOT_ADDRESS>root address:" MACSTR "\n",
                 MAC2STR(event.info.root_addr.addr));

        if (esp_mesh_is_root())
        	on_this_became_root();

        on_root_address();
        break;
    case MESH_EVENT_ROOT_GOT_IP:
        /* root starts to connect to server */

