markohladjak/Diamond/NodesController/src/Net/ESP32MeshNetService.cpp
        ESP_LOGI(MESH_TAG,
                 "<MESH_EVENT_ROOT_GOT_IP>sta ip: " IPSTR ", mask: " IPSTR ", gw: " IPSTR "\n",
                 IP2STR(&event.info.got_ip.ip_info.ip),
                 IP2STR(&event.info.got_ip.ip_info.netmask),
                 IP2STR(&event.info.got_ip.ip_info.gw));
        break;
    case MESH_EVENT_ROOT_LOST_IP:
        ESP_LOGI(MESH_TAG, "<MESH_EVENT_ROOT_LOST_IP>\n");
        break;
    case MESH_EVENT_VOTE_STARTED:
        ESP_LOGI(MESH_TAG,
                 "<MESH_EVENT_VOTE_STARTED>attempts:%d, reason:%d, rc_addr:" MACSTR "\n",
                 event.info.vote_started.attempts,
                 event.info.vote_started.reason,
                 MAC2STR(event.info.vote_started.rc_addr.addr));
        break;
    case MESH_EVENT_VOTE_STOPPED:
        ESP_LOGI(MESH_TAG, "<MESH_EVENT_VOTE_STOPPED>");
        break;
    case MESH_EVENT_ROOT_SWITCH_REQ:
        ESP_LOGI(MESH_TAG,
                 "<MESH_EVENT_ROOT_SWITCH_REQ>reason:%d, rc_addr:" MACSTR "\n",
                 event.info.switch_req.reason,
                 MAC2STR( event.info.switch_req.rc_addr.addr));
        break;
    case MESH_EVENT_ROOT_SWITCH_ACK:
        /* new root */
        _mesh_layer = esp_mesh_get_layer();
        esp_mesh_get_parent_bssid(&_mesh_parent_addr);
        ESP_LOGI(MESH_TAG, "<MESH_EVENT_ROOT_SWITCH_ACK>layer:%d, parent:" MACSTR "\n", _mesh_layer, MAC2STR(_mesh_parent_addr.addr));
        break;
    case MESH_EVENT_TODS_STATE:
        ESP_LOGI(MESH_TAG, "<MESH_EVENT_TODS_REACHABLE>state:%d\n",
                 event.info.toDS_state);
        break;
    case MESH_EVENT_ROOT_FIXED:
        ESP_LOGI(MESH_TAG, "<MESH_EVENT_ROOT_FIXED>%s\n",
                 event.info.root_fixed.is_fixed ? "fixed" : "not fixed");
        break;
    case MESH_EVENT_ROOT_ASKED_YIELD:
        ESP_LOGI(MESH_TAG,
                 "<MESH_EVENT_ROOT_ASKED_YIELD>" MACSTR ", rssi:%d, capacity:%d\n",
                 MAC2STR(event.info.root_conflict.addr),
                 event.info.root_conflict.rssi,
                 event.info.root_conflict.capacity);
        break;
    case MESH_EVENT_CHANNEL_SWITCH:
        ESP_LOGI(MESH_TAG, "<MESH_EVENT_CHANNEL_SWITCH>new channel:%d\n", event.info.channel_switch.channel);
        break;
    case MESH_EVENT_SCAN_DONE:
        ESP_LOGI(MESH_TAG, "<MESH_EVENT_SCAN_DONE>number:%d\n",
                 event.info.scan_done.number);

//	    if (_is_root)
//	    	mesh_scan_done_handler(event.info.scan_done.number);
        break;
    case MESH_EVENT_NETWORK_STATE:
        ESP_LOGI(MESH_TAG, "<MESH_EVENT_NETWORK_STATE>is_rootless:%d\n",
                 event.info.network_state.is_rootless);
        break;
    case MESH_EVENT_STOP_RECONNECTION:
        ESP_LOGI(MESH_TAG, "<MESH_EVENT_STOP_RECONNECTION>\n");
        break;
    case MESH_EVENT_FIND_NETWORK:
        ESP_LOGI(MESH_TAG, "<MESH_EVENT_FIND_NETWORK>new channel:%d, router BSSID:" MACSTR "\n",
                 event.info.find_network.channel, MAC2STR(event.info.find_network.router_bssid));
        break;
    case MESH_EVENT_ROUTER_SWITCH:
        ESP_LOGI(MESH_TAG, "<MESH_EVENT_ROUTER_SWITCH>new router:%s, channel:%d, " MACSTR "\n",
                 event.info.router_switch.ssid, event.info.router_switch.channel, MAC2STR(event.info.router_switch.bssid));
        break;
    default:
        ESP_LOGI(MESH_TAG, "unknown id:%d\n", event.id);
        break;
    }
}

void ESP32MeshNetService::mesh_data_rxtx_start() {
    static bool is_rxtx_started = false;
    if (!is_rxtx_started) {
    	is_rxtx_started = true;
        xTaskCreate(mesh_rx_task, "MPRX", 0x1000, NULL, 5, NULL);
    }
}

void ESP32MeshNetService::mesh_scan_done_handler(int num)
{
	int i;
	int ie_len = 0;
	mesh_assoc_t assoc;
	mesh_assoc_t parent_assoc;
	wifi_ap_record_t record;
	wifi_ap_record_t parent_record = { 0, };
	bool parent_found = false;
	mesh_type_t my_type = MESH_ROOT;
	int my_layer = MESH_ROOT_LAYER;
	wifi_config_t parent = { 0, };
//	wifi_scan_config_t scan_config = { 0 };

	parent_assoc.layer = 25;
	parent_assoc.rssi = -120;

	for (i = 0; i < num; i++) {
		esp_mesh_scan_get_ap_ie_len(&ie_len);
		esp_mesh_scan_get_ap_record(&record, &assoc);
		if (ie_len == sizeof(assoc)) {
			ESP_LOGW(MESH_TAG,
					 "<MESH>[%d]%s, layer:%d/%d, assoc:%d/%d, %d, " MACSTR ", channel:%u, rssi:%d, ID<" MACSTR "><%s>",
					 i, record.ssid, assoc.layer, assoc.layer_cap, assoc.assoc,
					 assoc.assoc_cap, assoc.layer2_cap, MAC2STR(record.bssid),
					 record.primary, record.rssi, MAC2STR(assoc.mesh_id), assoc.encrypted ? "IE Encrypted" : "IE Unencrypted");

		} else {
			ESP_LOGI(MESH_TAG, "[%d]%s, " MACSTR ", channel:%u, rssi:%d", i,
					 record.ssid, MAC2STR(record.bssid), record.primary,
					 record.rssi);

			if (!strcmp(_router_ssid.c_str(), (char *) record.ssid)) {
				parent_found = true;
				memcpy(&parent_record, &record, sizeof(record));
			}
		}
	}

	esp_mesh_flush_scan_result();

	if (parent_found) {
		/*
		 * parent
		 * Both channel and SSID of the parent are mandatory.
		 */
		parent.sta.channel = parent_record.primary;
		memcpy(&parent.sta.ssid, &parent_record.ssid, sizeof(parent_record.ssid));
		parent.sta.bssid_set = 1;
		memcpy(&parent.sta.bssid, parent_record.bssid, 6);
		ESP_ERROR_CHECK(esp_mesh_set_ap_authmode(parent_record.authmode));

		if (parent_record.authmode != WIFI_AUTH_OPEN) {
			memcpy(&parent.sta.password, _router_pw.c_str(), _router_pw.length());
		}

		ESP_LOGW(MESH_TAG, "<PARENT>%s, " MACSTR ", channel:%u, rssi:%d",
				 parent_record.ssid, MAC2STR(parent_record.bssid),
				 parent_record.primary, parent_record.rssi);

		ESP_ERROR_CHECK(esp_mesh_set_parent(&parent, (mesh_addr_t *)&parent_assoc.mesh_id, my_type, my_layer));

	}
}

//void ESP32MeshNetService::mesh_send_task(void *arg)
//{
//    int i;
//    esp_err_t err;
//    int send_count = 0;
//    mesh_addr_t route_table[_max_device_count];
//    int route_table_size = 0;
//    mesh_data_t data;
//    data.data = tx_buf;
//    data.size = sizeof(tx_buf);
//    data.proto = MESH_PROTO_BIN;
//    data.tos = MESH_TOS_P2P;
//
//    while (_is_running) {
//        /* non-root do nothing but print */
//        if (!esp_mesh_is_root()) {
//            ESP_LOGI(MESH_TAG, "layer:%d, rtableSize:%d, %s", _mesh_layer,
//                     esp_mesh_get_routing_table_size(),
//                     (_is_mesh_connected && esp_mesh_is_root()) ? "ROOT" : _is_mesh_connected ? "NODE" : "DISCONNECT");
//            vTaskDelay(10 * 1000 / portTICK_RATE_MS);
//            continue;
//        }
//        esp_mesh_get_routing_table((mesh_addr_t *) &route_table, _max_device_count * 6, &route_table_size);
//        if (send_count && !(send_count % 100)) {
//            ESP_LOGI(MESH_TAG, "size:%d/%d,send_count:%d", route_table_size,
//                     esp_mesh_get_routing_table_size(), send_count);
//        }
//        send_count++;
//        tx_buf[25] = (send_count >> 24) & 0xff;
//        tx_buf[24] = (send_count >> 16) & 0xff;
//        tx_buf[23] = (send_count >> 8) & 0xff;
//        tx_buf[22] = (send_count >> 0) & 0xff;
//        if (send_count % 2) {
//            memcpy(tx_buf, (uint8_t *)&light_on, sizeof(light_on));
//        } else {
//            memcpy(tx_buf, (uint8_t *)&light_off, sizeof(light_off));
//        }
//
//        for (i = 0; i < route_table_size; i++) {
//            err = esp_mesh_send(&route_table[i], &data, MESH_DATA_P2P, NULL, 0);
//            if (err) {
//                ESP_LOGE(MESH_TAG,
//                         "[ROOT-2-UNICAST:%d][L:%d]parent:"MACSTR" to "MACSTR", heap:%d[err:0x%x, proto:%d, tos:%d]",
//                         send_count, mesh_layer, MAC2STR(mesh_parent_addr.addr),
//                         MAC2STR(route_table[i].addr), esp_get_minimum_free_heap_size(),
//                         err, data.proto, data.tos);
//            } else if (!(send_count % 100)) {
//                ESP_LOGW(MESH_TAG,
//                         "[ROOT-2-UNICAST:%d][L:%d][rtableSize:%d]parent:"MACSTR" to "MACSTR", heap:%d[err:0x%x, proto:%d, tos:%d]",
//                         send_count, mesh_layer,
//                         esp_mesh_get_routing_table_size(),
//                         MAC2STR(mesh_parent_addr.addr),
//                         MAC2STR(route_table[i].addr), esp_get_minimum_free_heap_size(),
//                         err, data.proto, data.tos);
//            }
//        }
//        /* if route_table_size is less than 10, add delay to avoid watchdog in this task. */
//        if (route_table_size < 10) {
//            vTaskDelay(1 * 1000 / portTICK_RATE_MS);
//        }
//    }
//    vTaskDelete(NULL);
//}

void ESP32MeshNetService::mesh_rx_task(void *args) {
	static bool is_rx_running = false;
	if (is_rx_running) {
		LogService::Log("ESP32MeshNetService::mesh_rx_task", "already started");

		return;
	}

//    int recv_count = 0;
    esp_err_t err;
    mesh_addr_t from;
//    int send_count = 0;
    mesh_data_t data;
    int flag = 0;
    data.data = rx_buf;
    data.size = RX_SIZE;
    is_rx_running = true;

