markohladjak/Diamond/NodesController/src/Net/ESP32MeshNetService.cpp
    while (is_rx_running) {
        data.size = RX_SIZE;
        err = esp_mesh_recv(&from, &data, portMAX_DELAY, &flag, NULL, 0);
        if (err != ESP_OK || !data.size) {
            ESP_LOGE(MESH_TAG, "err:0x%x, size:%d", err, data.size);
            continue;
        }

        data.data[data.size] = 0;

        LogService::Log("ESP32MeshNetService::mesh_rx_task", (char*)data.data);
        LogService::Log("Heep Size", String(ESP.getHeapSize()));

        NetMessage msg((char*)data.data);

        if (msg.To() == NetAddress::BROADCAST) {
        	for (auto dvs: _local)
        		if (dvs.first != msg.From())
        			dvs.second->OnReceiveEvent(msg.From(), &msg);

        	continue;
        }

        if (msg.To() == NetAddress::SERVER) {
        	auto addr = NetAddress(_node_addr_mask + msg.To());
        	SetMessageEnds(msg, NULL, &addr);
        }

        auto dest = _local.find(msg.To());
        if (dest != _local.end()){
        	dest->second->OnReceiveEvent(msg.From(), &msg);
        }
    }

    is_rx_running = false;

    vTaskDelete(NULL);
}

void ESP32MeshNetService::run_mdns() {
	static bool started = false;

	if (started)
		return;
	started = true;

    esp_err_t err = mdns_init();
    if (err) {
		LogService::Log("MDNS", "Error setting up MDNS responder!");
        return;
    }

    mdns_hostname_set("diamond");
    mdns_instance_name_set("Nodes Controller");

	LogService::Log("MDNS", "Started.");
}

void ESP32MeshNetService::on_this_became_root() {
	if (_is_root_callback_funct)
		_is_root_callback_funct();

	for (auto netdvs: _local)
		netdvs.second->OnNodeIsRootEvent();
}

void ESP32MeshNetService::on_layer_changed(int layer){
	if (_layer_changed_callback_funct)
		_layer_changed_callback_funct(layer);

	for (auto netdvs: _local)
		netdvs.second->OnLayerChanged(layer);
}

void ESP32MeshNetService::on_routing_table_changed(){
	print_route_table();

	for (auto netdvs: _local)
		netdvs.second->OnLayoutChangedEvent();
}

void ESP32MeshNetService::on_root_address() {
	for (auto netdvs: _local)
		netdvs.second->OnRootAddressObtainedEvent();


	  if(!Ping.ping("8.8.8.8")){
		  Serial.println("Ping failed");
	  } else
		  Serial.println("Ping succesful.");

}

uint64_t ESP32MeshNetService::self_address(uint16_t device_num) {
    mesh_addr_t route_table[1];
    int route_table_size = 0;

    if (!_node_addr_mask) {
		esp_mesh_get_routing_table((mesh_addr_t *) &route_table, 6, &route_table_size);

		memcpy(((uint8_t*)&_node_addr_mask) + 2, (void*)(route_table[0].addr), 6);;

		_node_addr_mask &= 0xFFFFFFFFFFFF0000;
    }

	return _node_addr_mask + device_num;
}

void ESP32MeshNetService::print_route_table() {
    mesh_addr_t route_table[_max_device_count];
    int route_table_size = 0;

	esp_mesh_get_routing_table((mesh_addr_t *) &route_table, _max_device_count * 6, &route_table_size);

	printf("Routing table:\n");

	for (int i = 0; i < route_table_size; ++i) {
		printf("%3d    " MACSTR "\n", i, MAC2STR(route_table[i].addr));
	}
}

//void ESP32MeshNetService::mesh_rx_task(void *args) {

void ESP32MeshNetService::wifi_scan(void)
{
	LogService::Log("wifi_scan", "");

    xTaskCreate([](void* args) {
//    	static const char *ap_name = "Tenda_0AD898";


//        wifi_scan_config_t cfg = {
//			.ssid = NULL,
//    //	        .ssid = (uint8_t*)ap_name,
//            .bssid = NULL,
//            .channel = 0,
//            .show_hidden = false,
//            .scan_type = WIFI_SCAN_TYPE_ACTIVE,
//        };

//        cfg.scan_time.passive = 4000;
//        cfg.scan_time.active.min = 0;
//        cfg.scan_time.active.max = 1000;


        esp_mesh_stop();
//        ESP_ERROR_CHECK(esp_mesh_set_self_organized(0, 0));
//        esp_wifi_scan_stop();

//        esp_wifi_disconnect();
//        esp_mesh_disconnect();
        delay(3000);
        esp_mesh_start();

        vTaskDelete(NULL);

        return;


//        esp_wifi_get_config(interface, conf)
//        wifi_init_config_t wcfg = WIFI_INIT_CONFIG_DEFAULT();

//        ESP_ERROR_CHECK(esp_wifi_stop());
//        ESP_ERROR_CHECK(esp_wifi_init(&wcfg));


//        ESP_ERROR_CHECK(esp_wifi_set_config(ESP_IF_WIFI_STA, &wifi_config) );
//        ESP_ERROR_CHECK(esp_wifi_set_mode(WIFI_MODE_APSTA));
//        ESP_ERROR_CHECK(esp_wifi_start());


        ESP_ERROR_CHECK(esp_wifi_scan_start(NULL, true));

        wifi_ap_record_t *ap_info = NULL;
    	uint16_t ap_count = 0;

    	ESP_ERROR_CHECK(esp_wifi_scan_get_ap_num(&ap_count));

    	LogService::Log("wifi_scan, count", String(ap_count));

    	ap_info = new wifi_ap_record_t[ap_count];
    	memset(ap_info, 0, sizeof(wifi_ap_record_t) * ap_count);
    	LogService::Log("wifi_scan", "2");

    	ESP_ERROR_CHECK(esp_wifi_scan_get_ap_records(&ap_count, ap_info));

    	LogService::Log("wifi_scan", "3");

    	for (int i = 0; i < ap_count; i++) {
    		ESP_LOGI(TAG, "SSID \t\t%s     ", ap_info[i].ssid);
    		ESP_LOGI(TAG, "RSSI \t\t%d     ", ap_info[i].rssi);
    //        print_auth_mode(ap_info[i].authmode);
    //        if (ap_info[i]->authmode != WIFI_AUTH_WEP) {
    //            print_cipher_type(ap_info[i].pairwise_cipher, ap_info[i].group_cipher);
    //        }
    		ESP_LOGI(TAG, "Channel \t\t%d\n", ap_info[i].primary);
    	}

    	delete [] ap_info;

//    	esp_mesh_start();

//        esp_wifi_connect();


    	ESP_ERROR_CHECK(esp_mesh_set_self_organized(1, 0));
    	ESP_ERROR_CHECK(esp_mesh_connect());

        vTaskDelete(NULL);

    }, "WST", 0x1000, NULL, 5, NULL);
}

} /* namespace diamon */
